{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "#!pip3 install --upgrade pip\n",
    "#!pip3 install rdflib\n",
    "#!pip3 install SPARQLWrapper"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Criar Graph a partir de um script Turtle"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n",
      "<rdf:RDF\n",
      "   xmlns:rdf=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#\"\n",
      "   xmlns:rv=\"http://example.org/rainhavermelha#\"\n",
      ">\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#SangueNovo\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Blood\"/>\n",
      "    <rv:name>Sangue novo</rv:name>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#SaraSkonos\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Character\"/>\n",
      "    <rv:name>Sara Skonos</rv:name>\n",
      "    <rv:family>Skonos</rv:family>\n",
      "    <rv:hasBlood rdf:resource=\"http://example.org/rainhavermelha#Prateado\"/>\n",
      "    <rv:hasPower rdf:resource=\"http://example.org/rainhavermelha#Cura\"/>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#TiberiasCalore\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Character\"/>\n",
      "    <rv:name>Tiberias Calore</rv:name>\n",
      "    <rv:family>Calore</rv:family>\n",
      "    <rv:hasBlood rdf:resource=\"http://example.org/rainhavermelha#Prateado\"/>\n",
      "    <rv:hasPower rdf:resource=\"http://example.org/rainhavermelha#Fogo\"/>\n",
      "    <rv:sonOf rdf:resource=\"http://example.org/rainhavermelha#ReiTiberiasCalore\"/>\n",
      "    <rv:sonOf rdf:resource=\"http://example.org/rainhavermelha#CorianeJacos\"/>\n",
      "    <rv:brotherOf rdf:resource=\"http://example.org/rainhavermelha#MavenCalore\"/>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#CorianeJacos\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Character\"/>\n",
      "    <rv:name>Coriane Jacos</rv:name>\n",
      "    <rv:family>Jacos</rv:family>\n",
      "    <rv:hasBlood rdf:resource=\"http://example.org/rainhavermelha#Prateado\"/>\n",
      "    <rv:wasMarriedTo rdf:resource=\"http://example.org/rainhavermelha#ReiTiberiasCalore\"/>\n",
      "    <rv:motherOf rdf:resource=\"http://example.org/rainhavermelha#TiberiasCalore\"/>\n",
      "    <rv:sisterOf rdf:resource=\"http://example.org/rainhavermelha#JulianJacos\"/>\n",
      "    <rv:hasPower rdf:resource=\"http://example.org/rainhavermelha#Canto\"/>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#motherOf\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Character\"/>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#DanielBarrow\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Character\"/>\n",
      "    <rv:name>Daniel Barrow</rv:name>\n",
      "    <rv:family>Barrow</rv:family>\n",
      "    <rv:hasBlood rdf:resource=\"http://example.org/rainhavermelha#Vermelho\"/>\n",
      "    <rv:marriedTo rdf:resource=\"http://example.org/rainhavermelha#RuthBarrow\"/>\n",
      "    <rv:fatherOf rdf:resource=\"http://example.org/rainhavermelha#MareBarrow\"/>\n",
      "    <rv:fatherOf rdf:resource=\"http://example.org/rainhavermelha#BreeBarrow\"/>\n",
      "    <rv:fatherOf rdf:resource=\"http://example.org/rainhavermelha#TramyBarrow\"/>\n",
      "    <rv:fatherOf rdf:resource=\"http://example.org/rainhavermelha#ShadeBarrow\"/>\n",
      "    <rv:fatherOf rdf:resource=\"http://example.org/rainhavermelha#GisaBarrow\"/>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#TramyBarrow\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Character\"/>\n",
      "    <rv:name>Tramy Barrow</rv:name>\n",
      "    <rv:family>Barrow</rv:family>\n",
      "    <rv:hasBlood rdf:resource=\"http://example.org/rainhavermelha#Vermelho\"/>\n",
      "    <rv:sonOf rdf:resource=\"http://example.org/rainhavermelha#DanielBarrow\"/>\n",
      "    <rv:sonOf rdf:resource=\"http://example.org/rainhavermelha#RuthBarrow\"/>\n",
      "    <rv:brotherOf rdf:resource=\"http://example.org/rainhavermelha#MareBarrow\"/>\n",
      "    <rv:brotherOf rdf:resource=\"http://example.org/rainhavermelha#GisaBarrow\"/>\n",
      "    <rv:brotherOf rdf:resource=\"http://example.org/rainhavermelha#BreeBarrow\"/>\n",
      "    <rv:brotherOf rdf:resource=\"http://example.org/rainhavermelha#ShadeBarrow\"/>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#GisaBarrow\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Character\"/>\n",
      "    <rv:name>Gisa Barrow</rv:name>\n",
      "    <rv:family>Barrow</rv:family>\n",
      "    <rv:hasBlood rdf:resource=\"http://example.org/rainhavermelha#Vermelho\"/>\n",
      "    <rv:daughterOf rdf:resource=\"http://example.org/rainhavermelha#DanielBarrow\"/>\n",
      "    <rv:daughterOf rdf:resource=\"http://example.org/rainhavermelha#RuthBarrow\"/>\n",
      "    <rv:sisterOf rdf:resource=\"http://example.org/rainhavermelha#MareBarrow\"/>\n",
      "    <rv:sisterOf rdf:resource=\"http://example.org/rainhavermelha#BreeBarrow\"/>\n",
      "    <rv:sisterOf rdf:resource=\"http://example.org/rainhavermelha#TramyBarrow\"/>\n",
      "    <rv:sisterOf rdf:resource=\"http://example.org/rainhavermelha#ShadeBarrow\"/>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#EvangelineSamos\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Character\"/>\n",
      "    <rv:name>Evangeline Samos</rv:name>\n",
      "    <rv:family>Samos</rv:family>\n",
      "    <rv:hasBlood rdf:resource=\"http://example.org/rainhavermelha#Prateado\"/>\n",
      "    <rv:hasPower rdf:resource=\"http://example.org/rainhavermelha#Metal\"/>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#RainhaElara\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Character\"/>\n",
      "    <rv:name>Rainha Elara</rv:name>\n",
      "    <rv:family>Merandus</rv:family>\n",
      "    <rv:hasBlood rdf:resource=\"http://example.org/rainhavermelha#Prateado\"/>\n",
      "    <rv:hasPower rdf:resource=\"http://example.org/rainhavermelha#Murmurio\"/>\n",
      "    <rv:marriedTo rdf:resource=\"http://example.org/rainhavermelha#ReiTiberiasCalore\"/>\n",
      "    <rv:motherOf rdf:resource=\"http://example.org/rainhavermelha#MavenCalore\"/>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#JulianJacos\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Character\"/>\n",
      "    <rv:name>Julian Jacos</rv:name>\n",
      "    <rv:family>Jacos</rv:family>\n",
      "    <rv:hasBlood rdf:resource=\"http://example.org/rainhavermelha#Prateado\"/>\n",
      "    <rv:hasPower rdf:resource=\"http://example.org/rainhavermelha#Canto\"/>\n",
      "    <rv:brotherOf rdf:resource=\"http://example.org/rainhavermelha#CorianeJacos\"/>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#RuthBarrow\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Character\"/>\n",
      "    <rv:name>Ruth Barrow</rv:name>\n",
      "    <rv:family>Barrow</rv:family>\n",
      "    <rv:hasBlood rdf:resource=\"http://example.org/rainhavermelha#Vermelho\"/>\n",
      "    <rv:marriedTo rdf:resource=\"http://example.org/rainhavermelha#DanielBarrow\"/>\n",
      "    <rv:motherOf rdf:resource=\"http://example.org/rainhavermelha#MareBarrow\"/>\n",
      "    <rv:motherOf rdf:resource=\"http://example.org/rainhavermelha#BreeBarrow\"/>\n",
      "    <rv:motherOf rdf:resource=\"http://example.org/rainhavermelha#TramyBarrow\"/>\n",
      "    <rv:motherOf rdf:resource=\"http://example.org/rainhavermelha#ShadeBarrow\"/>\n",
      "    <rv:motherOf rdf:resource=\"http://example.org/rainhavermelha#GisaBarrow\"/>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#MareBarrow\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Character\"/>\n",
      "    <rv:name>Mare Barrow</rv:name>\n",
      "    <rv:family>Barrow</rv:family>\n",
      "    <rv:hasBlood rdf:resource=\"http://example.org/rainhavermelha#SangueNovo\"/>\n",
      "    <rv:hasPower rdf:resource=\"http://example.org/rainhavermelha#Eletricidade\"/>\n",
      "    <rv:daughterOf rdf:resource=\"http://example.org/rainhavermelha#DanielBarrow\"/>\n",
      "    <rv:daughterOf rdf:resource=\"http://example.org/rainhavermelha#RuthBarrow\"/>\n",
      "    <rv:sisterOf rdf:resource=\"http://example.org/rainhavermelha#GisaBarrow\"/>\n",
      "    <rv:sisterOf rdf:resource=\"http://example.org/rainhavermelha#BreeBarrow\"/>\n",
      "    <rv:sisterOf rdf:resource=\"http://example.org/rainhavermelha#TramyBarrow\"/>\n",
      "    <rv:sisterOf rdf:resource=\"http://example.org/rainhavermelha#ShadeBarrow\"/>\n",
      "    <rv:bestfriendOf rdf:resource=\"http://example.org/rainhavermelha#KilornWarren\"/>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#BreeBarrow\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Character\"/>\n",
      "    <rv:name>Bree Barrow</rv:name>\n",
      "    <rv:family>Barrow</rv:family>\n",
      "    <rv:hasBlood rdf:resource=\"http://example.org/rainhavermelha#Vermelho\"/>\n",
      "    <rv:sonOf rdf:resource=\"http://example.org/rainhavermelha#DanielBarrow\"/>\n",
      "    <rv:sonOf rdf:resource=\"http://example.org/rainhavermelha#RuthBarrow\"/>\n",
      "    <rv:brotherOf rdf:resource=\"http://example.org/rainhavermelha#MareBarrow\"/>\n",
      "    <rv:brotherOf rdf:resource=\"http://example.org/rainhavermelha#GisaBarrow\"/>\n",
      "    <rv:brotherOf rdf:resource=\"http://example.org/rainhavermelha#TramyBarrow\"/>\n",
      "    <rv:brotherOf rdf:resource=\"http://example.org/rainhavermelha#ShadeBarrow\"/>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#sisterOf\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Character\"/>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#KilornWarren\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Character\"/>\n",
      "    <rv:name>Kilorn Warren</rv:name>\n",
      "    <rv:hasBlood rdf:resource=\"http://example.org/rainhavermelha#Vermelho\"/>\n",
      "    <rv:bestfriendOf rdf:resource=\"http://example.org/rainhavermelha#MareBarrow\"/>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#Prateado\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Blood\"/>\n",
      "    <rv:name>Sangue Prateado</rv:name>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#MavenCalore\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Character\"/>\n",
      "    <rv:name>Maven Calore</rv:name>\n",
      "    <rv:family>Calore</rv:family>\n",
      "    <rv:hasBlood rdf:resource=\"http://example.org/rainhavermelha#Prateado\"/>\n",
      "    <rv:hasPower rdf:resource=\"http://example.org/rainhavermelha#Fogo\"/>\n",
      "    <rv:tricked rdf:resource=\"http://example.org/rainhavermelha#MareBarrow\"/>\n",
      "    <rv:sonOf rdf:resource=\"http://example.org/rainhavermelha#ReiTiberiasCalore\"/>\n",
      "    <rv:sonOf rdf:resource=\"http://example.org/rainhavermelha#RainhaElara\"/>\n",
      "    <rv:brotherOf rdf:resource=\"http://example.org/rainhavermelha#TiberiasCalore\"/>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#ReiTiberiasCalore\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Character\"/>\n",
      "    <rv:name>Rei Tiberias Calore</rv:name>\n",
      "    <rv:family>Calore</rv:family>\n",
      "    <rv:hasBlood rdf:resource=\"http://example.org/rainhavermelha#Prateado\"/>\n",
      "    <rv:hasPower rdf:resource=\"http://example.org/rainhavermelha#Fogo\"/>\n",
      "    <rv:wasMarriedTo rdf:resource=\"http://example.org/rainhavermelha#CorianeJacos\"/>\n",
      "    <rv:marriedTo rdf:resource=\"http://example.org/rainhavermelha#RainhaElara\"/>\n",
      "    <rv:fatherOf rdf:resource=\"http://example.org/rainhavermelha#MavenCalore\"/>\n",
      "    <rv:fatherOf rdf:resource=\"http://example.org/rainhavermelha#TiberiasCalore\"/>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#ShadeBarrow\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Character\"/>\n",
      "    <rv:name>Shade Barrow</rv:name>\n",
      "    <rv:family>Barrow</rv:family>\n",
      "    <rv:hasBlood rdf:resource=\"http://example.org/rainhavermelha#SangueNovo\"/>\n",
      "    <rv:hasPower rdf:resource=\"http://example.org/rainhavermelha#Teletransporte\"/>\n",
      "    <rv:sonOf rdf:resource=\"http://example.org/rainhavermelha#DanielBarrow\"/>\n",
      "    <rv:sonOf rdf:resource=\"http://example.org/rainhavermelha#RuthBarrow\"/>\n",
      "    <rv:brotherOf rdf:resource=\"http://example.org/rainhavermelha#MareBarrow\"/>\n",
      "    <rv:brotherOf rdf:resource=\"http://example.org/rainhavermelha#GisaBarrow\"/>\n",
      "    <rv:brotherOf rdf:resource=\"http://example.org/rainhavermelha#TramyBarrow\"/>\n",
      "    <rv:brotherOf rdf:resource=\"http://example.org/rainhavermelha#BreeBarrow\"/>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#Fogo\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Power\"/>\n",
      "    <rv:name>Fogo</rv:name>\n",
      "    <rv:description>Manipular Fogo</rv:description>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#Eletricidade\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Power\"/>\n",
      "    <rv:name>Eletricidade</rv:name>\n",
      "    <rv:description>Manipular Eletricidade</rv:description>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#family\">\n",
      "    <rdf:type rdf:resource=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#Property\"/>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#Vermelho\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Blood\"/>\n",
      "    <rv:name>Sangue Vermelho</rv:name>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#marriedTo\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Character\"/>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#hasPower\">\n",
      "    <rdf:type rdf:resource=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#Property\"/>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#Murmurio\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Power\"/>\n",
      "    <rv:name>Murmurio</rv:name>\n",
      "    <rv:description>Ler e Controlar a mente atraves de sussurros</rv:description>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#Cura\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Power\"/>\n",
      "    <rv:name>Cura</rv:name>\n",
      "    <rv:description>Curar feridas e machucados pelo toque</rv:description>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#Metal\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Power\"/>\n",
      "    <rv:name>Metal</rv:name>\n",
      "    <rv:description>Manipular Metal</rv:description>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#sonOf\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Character\"/>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#hasBlood\">\n",
      "    <rdf:type rdf:resource=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#Property\"/>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#tricked\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Character\"/>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#wasMarriedTo\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Character\"/>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#daughterOf\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Character\"/>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#Teletransporte\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Power\"/>\n",
      "    <rv:name>Teletransporte</rv:name>\n",
      "    <rv:description>Se teletransportar</rv:description>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#Canto\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Power\"/>\n",
      "    <rv:name>Canto</rv:name>\n",
      "    <rv:description>Hipnose atraves do canto</rv:description>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#followedBy\">\n",
      "    <rdf:type rdf:resource=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#Property\"/>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#fatherOf\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Character\"/>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#brotherOf\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Character\"/>\n",
      "  </rdf:Description>\n",
      "  <rdf:Description rdf:about=\"http://example.org/rainhavermelha#bestfriendOf\">\n",
      "    <rdf:type rdf:resource=\"http://example.org/rainhavermelha#Character\"/>\n",
      "  </rdf:Description>\n",
      "</rdf:RDF>\n",
      "\n"
     ]
    }
   ],
   "source": [
    "from rdflib import Graph, URIRef, Literal ,Namespace\n",
    "\n",
    "g = Graph()\n",
    "g.parse(data = \"\"\"\n",
    "@prefix rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .\n",
    "@prefix rv: <http://example.org/rainhavermelha#> .\n",
    "\n",
    "        \n",
    "# Relacionamentos\n",
    "rv:followedBy rdf:type rdf:Property .\n",
    "rv:hasPower rdf:type rdf:Property .\n",
    "rv:hasBlood rdf:type rdf:Property .\n",
    "rv:family rdf:type rdf:Property .\n",
    "rv:tricked rdf:type rv:Character .\n",
    "rv:marriedTo rdf:type rv:Character .\n",
    "rv:wasMarriedTo rdf:type rv:Character .\n",
    "rv:sonOf rdf:type rv:Character .\n",
    "rv:daughterOf rdf:type rv:Character .\n",
    "rv:fatherOf rdf:type rv:Character .\n",
    "rv:motherOf rdf:type rv:Character .\n",
    "rv:sisterOf rdf:type rv:Character .\n",
    "rv:brotherOf rdf:type rv:Character .\n",
    "rv:bestfriendOf rdf:type rv:Character .\n",
    "\n",
    "\n",
    "# Sangue\n",
    "rv:Vermelho rdf:type rv:Blood ;\n",
    "    rv:name \"Sangue Vermelho\" .\n",
    "\n",
    "rv:Prateado rdf:type rv:Blood ;\n",
    "    rv:name \"Sangue Prateado\" .\n",
    "        \n",
    "rv:SangueNovo rdf:type rv:Blood ; \n",
    "    rv:name \"Sangue novo\" .\n",
    "\n",
    "        \n",
    "# Poderes\n",
    "rv:Eletricidade rdf:type rv:Power ;\n",
    "    rv:name \"Eletricidade\" ;\n",
    "    rv:description \"Manipular Eletricidade\" .\n",
    "\n",
    "rv:Fogo rdf:type rv:Power ;\n",
    "    rv:name \"Fogo\" ;\n",
    "    rv:description \"Manipular Fogo\" .\n",
    "        \n",
    "rv:Murmurio rdf:type rv:Power ;\n",
    "    rv:name \"Murmurio\" ;\n",
    "    rv:description \"Ler e Controlar a mente atraves de sussurros\" . \n",
    "\n",
    "rv:Metal rdf:type rv:Power ;\n",
    "    rv:name \"Metal\" ;\n",
    "    rv:description \"Manipular Metal\" .\n",
    "\n",
    "rv:Cura rdf:type rv:Power ;\n",
    "    rv:name \"Cura\" ;\n",
    "    rv:description \"Curar feridas e machucados pelo toque\" .\n",
    "        \n",
    "rv:Canto rdf:type rv:Power ;\n",
    "    rv:name \"Canto\" ;\n",
    "    rv:description \"Hipnose atraves do canto\" .\n",
    "\n",
    "rv:Teletransporte rdf:type rv:Power ;\n",
    "    rv:name \"Teletransporte\" ;\n",
    "    rv:description \"Se teletransportar\" .\n",
    "        \n",
    "\n",
    "# Personagens\n",
    "rv:MareBarrow rdf:type rv:Character ;\n",
    "    rv:name \"Mare Barrow\" ;\n",
    "    rv:family \"Barrow\" ;\n",
    "    rv:hasBlood rv:SangueNovo ;\n",
    "    rv:hasPower rv:Eletricidade ;\n",
    "    rv:daughterOf rv:DanielBarrow, rv:RuthBarrow ;\n",
    "    rv:sisterOf rv:GisaBarrow, rv:BreeBarrow, rv:TramyBarrow, rv:ShadeBarrow ;\n",
    "    rv:bestfriendOf rv:KilornWarren .\n",
    "\n",
    "rv:TiberiasCalore rdf:type rv:Character ;\n",
    "    rv:name \"Tiberias Calore\" ;\n",
    "    rv:family \"Calore\" ;\n",
    "    rv:hasBlood rv:Prateado ;\n",
    "    rv:hasPower rv:Fogo ;\n",
    "    rv:sonOf rv:ReiTiberiasCalore, rv:CorianeJacos ;\n",
    "    rv:brotherOf rv:MavenCalore .\n",
    "\n",
    "rv:MavenCalore rdf:type rv:Character ;\n",
    "    rv:name \"Maven Calore\" ;\n",
    "    rv:family \"Calore\" ;\n",
    "    rv:hasBlood rv:Prateado ;\n",
    "    rv:hasPower rv:Fogo ;\n",
    "    rv:tricked rv:MareBarrow ;\n",
    "    rv:sonOf rv:ReiTiberiasCalore, rv:RainhaElara;\n",
    "    rv:brotherOf rv:TiberiasCalore .\n",
    "\n",
    "rv:KilornWarren rdf:type rv:Character ;\n",
    "    rv:name \"Kilorn Warren\" ;\n",
    "    rv:hasBlood rv:Vermelho ;\n",
    "    rv:bestfriendOf rv:MareBarrow .\n",
    "        \n",
    "rv:DanielBarrow rdf:type rv:Character ;\n",
    "    rv:name \"Daniel Barrow\" ;\n",
    "    rv:family \"Barrow\" ;\n",
    "    rv:hasBlood rv:Vermelho ;\n",
    "    rv:marriedTo rv:RuthBarrow ;\n",
    "    rv:fatherOf rv:MareBarrow, rv:BreeBarrow, rv:TramyBarrow, rv:ShadeBarrow , rv:GisaBarrow .\n",
    "\n",
    "rv:RuthBarrow rdf:type rv:Character ;\n",
    "    rv:name \"Ruth Barrow\" ;\n",
    "    rv:family \"Barrow\" ;\n",
    "    rv:hasBlood rv:Vermelho ;\n",
    "    rv:marriedTo rv:DanielBarrow ;\n",
    "    rv:motherOf rv:MareBarrow, rv:BreeBarrow, rv:TramyBarrow, rv:ShadeBarrow , rv:GisaBarrow .\n",
    "\n",
    "rv:GisaBarrow rdf:type rv:Character ;\n",
    "    rv:name \"Gisa Barrow\" ;\n",
    "    rv:family \"Barrow\" ;\n",
    "    rv:hasBlood rv:Vermelho ;\n",
    "    rv:daughterOf rv:DanielBarrow, rv:RuthBarrow ;\n",
    "    rv:sisterOf rv:MareBarrow, rv:BreeBarrow, rv:TramyBarrow, rv:ShadeBarrow .\n",
    "\n",
    "rv:BreeBarrow rdf:type rv:Character ;\n",
    "    rv:name \"Bree Barrow\" ;\n",
    "    rv:family \"Barrow\" ;\n",
    "    rv:hasBlood rv:Vermelho ;\n",
    "    rv:sonOf rv:DanielBarrow, rv:RuthBarrow ;\n",
    "    rv:brotherOf rv:MareBarrow, rv:GisaBarrow, rv:TramyBarrow, rv:ShadeBarrow .\n",
    "        \n",
    "rv:TramyBarrow rdf:type rv:Character ;\n",
    "    rv:name \"Tramy Barrow\" ;\n",
    "    rv:family \"Barrow\" ;\n",
    "    rv:hasBlood rv:Vermelho ;\n",
    "    rv:sonOf rv:DanielBarrow, rv:RuthBarrow ;\n",
    "    rv:brotherOf rv:MareBarrow, rv:GisaBarrow, rv:BreeBarrow, rv:ShadeBarrow .\n",
    "        \n",
    "rv:ShadeBarrow rdf:type rv:Character ;\n",
    "    rv:name \"Shade Barrow\" ;\n",
    "    rv:family \"Barrow\" ;\n",
    "    rv:hasBlood rv:SangueNovo ;\n",
    "    rv:hasPower rv:Teletransporte ;\n",
    "    rv:sonOf rv:DanielBarrow, rv:RuthBarrow ;\n",
    "    rv:brotherOf rv:MareBarrow, rv:GisaBarrow, rv:TramyBarrow, rv:BreeBarrow .\n",
    "\n",
    "rv:EvangelineSamos rdf:type rv:Character ;\n",
    "    rv:name \"Evangeline Samos\" ;\n",
    "    rv:family \"Samos\" ;\n",
    "    rv:hasBlood rv:Prateado ;\n",
    "    rv:hasPower rv:Metal .\n",
    "\n",
    "rv:RainhaElara rdf:type rv:Character ;\n",
    "    rv:name \"Rainha Elara\" ;\n",
    "    rv:family \"Merandus\" ;\n",
    "    rv:hasBlood rv:Prateado ;\n",
    "    rv:hasPower rv:Murmurio ;\n",
    "    rv:marriedTo rv:ReiTiberiasCalore ;\n",
    "    rv:motherOf rv:MavenCalore .\n",
    "        \n",
    "rv:ReiTiberiasCalore rdf:type rv:Character ;\n",
    "    rv:name \"Rei Tiberias Calore\" ;\n",
    "    rv:family \"Calore\" ;\n",
    "    rv:hasBlood rv:Prateado ;\n",
    "    rv:hasPower rv:Fogo ;\n",
    "    rv:wasMarriedTo rv:CorianeJacos ;\n",
    "    rv:marriedTo rv:RainhaElara ;\n",
    "    rv:fatherOf rv:MavenCalore, rv:TiberiasCalore .\n",
    "        \n",
    "rv:CorianeJacos rdf:type rv:Character ;\n",
    "    rv:name \"Coriane Jacos\" ;\n",
    "    rv:family \"Jacos\" ;\n",
    "    rv:hasBlood rv:Prateado ;\n",
    "    rv:wasMarriedTo rv:ReiTiberiasCalore ;\n",
    "    rv:motherOf rv:TiberiasCalore ;\n",
    "    rv:sisterOf rv:JulianJacos ;\n",
    "    rv:hasPower rv:Canto .\n",
    "        \n",
    "rv:JulianJacos rdf:type rv:Character ;\n",
    "    rv:name \"Julian Jacos\" ;\n",
    "    rv:family \"Jacos\" ;\n",
    "    rv:hasBlood rv:Prateado ;\n",
    "    rv:hasPower rv:Canto ;\n",
    "    rv:brotherOf rv:CorianeJacos .\n",
    "        \n",
    "rv:SaraSkonos rdf:type rv:Character ;\n",
    "    rv:name \"Sara Skonos\" ;\n",
    "    rv:family \"Skonos\" ;\n",
    "    rv:hasBlood rv:Prateado ;\n",
    "    rv:hasPower rv:Cura .\n",
    "\n",
    "\n",
    "\"\"\", format=\"ttl\")\n",
    "\n",
    "xml_data = g.serialize(format=\"xml\")\n",
    "\n",
    "print(xml_data)\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Queries respondendo as perguntas do site e guardando tais em um dict"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "import rdflib\n",
    "from rdflib import Namespace,Literal\n",
    "from rdflib.namespace import RDF,RDFS,DC,XSD\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "queries = [\"\"\"SELECT ?resposta WHERE { ?personagem rv:hasBlood rv:SangueNovo. ?personagem rv:name ?resposta }\"\"\", \"\"\"SELECT distinct ?resposta WHERE { {?personagem rv:name ?resposta. ?personagem rv:sisterOf ?irmaos} UNION { ?personagem rv:name ?resposta. ?personagem rv:brotherOf ?irmaosS }}\"\"\",\"\"\"SELECT (COUNT( DISTINCT ?s) as ?resposta) WHERE { ?s  rv:hasBlood ?b }\"\"\",\"\"\"SELECT ?resposta WHERE { ?poder rdf:type rv:Power. ?poder rv:name ?resposta }\"\"\",\"\"\"SELECT ?resposta WHERE { ?personagem rdf:type rv:Character. ?personagem rv:name \"Rei Tiberias Calore\". ?personagem rv:hasPower ?poder. ?poder rv:name ?resposta }\"\"\",\"\"\"SELECT ?resposta WHERE { rv:EvangelineSamos rv:family ?resposta }\"\"\",\"\"\"SELECT ?resposta (count( ?personagem ) as ?count) WHERE { ?personagem rdf:type rv:Character. ?personagem rv:family ?resposta } GROUP BY ?resposta ORDER BY DESC(?count) LIMIT 1\"\"\",\"\"\"SELECT ?resposta WHERE { ?personagem rdf:type rv:Character. ?personagem rv:name \"Mare Barrow\". ?personagem rv:hasPower ?poder. ?poder rv:name ?resposta }\"\"\",\"\"\"SELECT ?resposta WHERE { ?personagem rv:name \"Rei Tiberias Calore\". ?personagem rv:fatherOf ?filhos. ?filhos rv:name ?resposta }\"\"\",\"\"\"SELECT ?resposta WHERE { ?sangue rdf:type rv:Blood. ?sangue rv:name ?resposta }\"\"\"]\n",
    "\n",
    "dict={}\n",
    "list = []\n",
    "i = 1\n",
    "\n",
    "for q in queries:\n",
    "    qres = g.query(q)\n",
    "    for row in qres:\n",
    "        list.append(row.asdict()['resposta'].toPython())\n",
    "        #list.append(row.asdict()['resposta'].toPython())\n",
    "    dict[i] = list\n",
    "    list = []\n",
    "    i+=1\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{1: ['Mare Barrow', 'Shade Barrow'], 2: ['Mare Barrow', 'Gisa Barrow', 'Coriane Jacos', 'Tiberias Calore', 'Maven Calore', 'Bree Barrow', 'Tramy Barrow', 'Shade Barrow', 'Julian Jacos'], 3: [16], 4: ['Eletricidade', 'Fogo', 'Murmurio', 'Metal', 'Cura', 'Canto', 'Teletransporte'], 5: ['Fogo'], 6: ['Samos'], 7: ['Barrow'], 8: ['Eletricidade'], 9: ['Maven Calore', 'Tiberias Calore'], 10: ['Sangue Vermelho', 'Sangue Prateado', 'Sangue novo']}\n"
     ]
    }
   ],
   "source": [
    "print(dict)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.2"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
